{
	"_meta": {
		"sources": [
			{
				"json": "Homebrew Spells",
				"abbreviation": "HS",
				"full": "Homebrew Spells",
				"authors": [
					"Trenton Campbell"
				],
				"version": "1.0.0",
				"url": "https://github.com/TrentonDC/Homebrew",
				"targetSchema": "1.2.3"
			}
		],
		"dateAdded": 1584162923,
		"dateLastModified": 1584162923
	},
	"spell": [
		{
			"name": "Angel Strike",
			"source": "Homebrew Spells",
			"level": 3,
			"school": "C",
			"time": [
				{
					"number": 1,
					"unit": "action"
				}
			],
			"range": {
				"type": "point",
				"distance": {
					"type": "self"
				}
			},
			"components": {
				"s": true,
				"m": "a melee weapon worth at least 1 sp"
			},
			"duration": [
				{
					"type": "instant"
				}
			],
			"entries": [
				"You flourish the weapon used in the casting and ascend up to 60 feet in the air to strike like an angel. Until the end of your turn, wings of angelic radiance sprout from your back, allowing you to glide through the air. You can move up to 2 feet horizontally for every 1 foot you descend. While you have these wings, you can subtract up to 100 feet from the fall when calculating falling damage. If you already have wings then you don't sprout new ones and if you have a flying speed then you can fly as normal.",
				"Until the end of your turn, you can strike one creature that you can see directly beneath you while you are in the air. Make a melee spell attack against the target. On a hit, the target takes {@damage 5d8} force damage. You then land in an unoccupied space you can see within 5 feet of the target."
			],
			"entriesHigherLevel": [
				{
					"type": "entries",
					"name": "At Higher Levels",
					"entries": [
						"When you cast this spell using a spell slot of 4th level or higher, the damage increases by {@scaledamage 5d8|3-9|1d8} for each slot level above 3rd."
					]
				}
			],
			"damageInflict": [
				"force"
			],
			"classes": {
				"fromClassList": [
					{
						"name": "Cleric",
						"source": "PHB"
					},
					{
						"name": "Paladin",
						"source": "PHB"
					}
				]
			},
			"uniqueId": "c2312ec49465c7dba36a9267b4cf6c37"
		},
		{
			"name": "Bees?!",
			"source": "Homebrew Spells",
			"level": 0,
			"school": "C",
			"time": [
				{
					"number": 1,
					"unit": "action"
				}
			],
			"range": {
				"type": "point",
				"distance": {
					"type": "feet",
					"amount": "10"
				}
			},
			"components": {
				"v": true,
				"s": true
			},
			"duration": [
				{
					"type": "instant"
				}
			],
			"entries": [
				"You extend your hand toward a creature you can see within range and project a small swarm of bees from your palm. The creature must succeed on a Constitution saving throw or take {@damage 1d12} piercing  damage.",
				"This spell’s damage increases by {@damage 1d12} when you reach 5th level ({@damage 2d12}), 11th level ({@damage 3d12}), and 17th level ({@damage 4d12})."
			],
			"damageInflict": [
				"piercing"
			],
			"savingThrow": [
				"constitution"
			],
			"classes": {
				"fromClassList": [
					{
						"name": "Druid",
						"source": "PHB"
					},
					{
						"name": "Sorcerer",
						"source": "PHB"
					},
					{
						"name": "Warlock",
						"source": "PHB"
					},
					{
						"name": "Wizard",
						"source": "PHB"
					}
				]
			},
			"uniqueId": "de69dfc830683593a044c5f220c1a06e"
		},
		{
			"name": "Black Death",
			"source": "Homebrew Spells",
			"level": 7,
			"school": "N",
			"time": [
				{
					"number": 1,
					"unit": "action"
				}
			],
			"range": {
				"type": "point",
				"distance": {
					"type": "touch"
				}
			},
			"components": {
				"v": true,
				"s": true
			},
			"duration": [
				{
					"type": "instant"
				}
			],
			"entries": [
				"You attempt to infect a creature with a horrid disease. One beast or humanoid you touch must succeed a Constitution saving throw or become afflicted with the plague.",
				"Symptoms manifest {@damage 2d12} hours after infection and include fever and disorientation. If the creature is humanoid, its hands, nose, and lymph nodes swell and turn black. The infected creature’s speed is reduced by half. It has disadvantage on weapon attack rolls as well as Strength and Dexterity saving throws. Creatures have advantage on attack rolls against the infected creature.",
				"Any beast or humanoid, other than you, that starts its turn within 5 feet of an infected creature must succeed a DC 17 Constitution saving throw or also become infected with the disease. Once a creature succeeds on this save, it is immune to the disease for 24 hours.",
				"The disease can be cured only by magic. If a creature is infected for {@damage 1d10} days, it dies. The corpse of the creature continues to spread the disease in a 20 foot radius until it is destroyed."
			],
			"savingThrow": [
				"constitution"
			],
			"classes": {
				"fromClassList": [
					{
						"name": "Cleric",
						"source": "PHB"
					},
					{
						"name": "Wizard",
						"source": "PHB"
					}
				]
			},
			"uniqueId": "505264a4bb0ca8e613024f78d0a0073d"
		},
		{
			"name": "Call Undead",
			"source": "Homebrew Spells",
			"level": 9,
			"school": "N",
			"time": [
				{
					"number": 1,
					"unit": "action"
				}
			],
			"range": {
				"type": "point",
				"distance": {
					"type": "feet",
					"amount": "300"
				}
			},
			"components": {
				"v": true,
				"m": "a bone of a humanoid"
			},
			"duration": [
				{
					"type": "instant"
				}
			],
			"entries": [
				"You summon {@creature skeleton|mm|skeletons} and {@creature zombie|dmg|zombies}, calling forth as many of them as you can divide 500 hit points among, each undead having average hit points (the DM has the creatures game statistics). The undead magically rise up from the ground or otherwise form in unoccupied spaces within range. In addition, the ground around you becomes desecrated up to the spell’s range for 24 hours (see chapter 5 of the Dungeon Master’s Guide, p.110).",
				"The summoned undead obey your verbal commands until they are destroyed or until dawn of the next day, when they collapse into inanimate piles of bones and rotting corpses."
			],
			"classes": {
				"fromClassList": [
					{
						"name": "Cleric",
						"source": "PHB"
					},
					{
						"name": "Warlock",
						"source": "PHB"
					},
					{
						"name": "Wizard",
						"source": "PHB"
					}
				]
			},
			"uniqueId": "e09426905d877c517d856aeee6e658ea"
		},
		{
			"name": "Coin Shot",
			"source": "Homebrew Spells",
			"level": 0,
			"school": "T",
			"time": [
				{
					"number": 1,
					"unit": "action"
				}
			],
			"range": {
				"type": "point",
				"distance": {
					"type": "feet",
					"amount": "60"
				}
			},
			"components": {
				"s": true,
				"m": {
					"text": "a coin, which the spell consumes",
					"consume": true
				}
			},
			"duration": [
				{
					"type": "instant"
				}
			],
			"entries": [
				"The chosen coin shoots from your hand towards a creature or object within range. Make a ranged spell attack against the target. On a hit, the target takes bludgeoning damage depending on the value of the coin used:",
				{
					"type": "table",
					"colLabels": [
						"Coin",
						"Damage"
					],
					"colStyles": [
						"col-1 text-left",
						"col-3"
					],
					"rows": [
						[
							{
								"type": "cell",
								"roll": {
									"exact": "copper",
									"pad": true
								}
							},
							"{@dice 1d4}"
						],
						[
							{
								"type": "cell",
								"roll": {
									"exact": "silver"
								}
							},
							"{@dice 1d6}"
						],
						[
							{
								"type": "cell",
								"roll": {
									"exact": "electrum"
								}
							},
							"{@dice 1d8}"
						],
						[
							{
								"type": "cell",
								"roll": {
									"exact": "gold"
								}
							},
							"{@dice 1d10}"
						],
						[
							{
								"type": "cell",
								"roll": {
									"exact": "platinum"
								}
							},
							"{@dice 1d12}"
						]
					]
				},
				"You can shoot additional coins when you reach higher levels: two shots at 5th level, three shots at 11th level, and four shots at 17th level. You can direct the shots at the same target or at different ones. Expend a new coin and make a separate attack roll for each shot."
			],
			"damageInflict": [
				"bludgeoning"
			],
			"spellAttack": [
				"R"
			],
			"classes": {
				"fromClassList": [
					{
						"name": "Bard",
						"source": "PHB"
					},
					{
						"name": "Sorcerer",
						"source": "PHB"
					},
					{
						"name": "Wizard",
						"source": "PHB"
					}
				]
			},
			"uniqueId": "c405407c999b9c78b84e26383d5f40b2"
		},
		{
			"name": "Fixed Odds",
			"source": "Homebrew Spells",
			"level": 1,
			"school": "T",
			"time": [
				{
					"number": 1,
					"unit": "reaction",
					"condition": "which you take when you see a coin flip, die roll, card draw, or  similar randomized event occurring within 30 feet of you"
				}
			],
			"range": {
				"type": "point",
				"distance": {
					"type": "feet",
					"amount": "30"
				}
			},
			"components": {
				"s": true
			},
			"duration": [
				{
					"type": "instant"
				}
			],
			"entries": [
				"You take fate into your own hands, influencing the result of one randomized event such as a coin flip, die roll, or card draw. You choose the result of the event. If you choose a result that is impossible, the spell fails. This spell has no effect on magic items."
			],
			"classes": {
				"fromClassList": [
					{
						"name": "Bard",
						"source": "PHB"
					},
					{
						"name": "Cleric",
						"source": "PHB"
					},
					{
						"name": "Paladin",
						"source": "PHB"
					},
					{
						"name": "Sorcerer",
						"source": "PHB"
					},
					{
						"name": "Wizard",
						"source": "PHB"
					}
				]
			},
			"uniqueId": "71372e2dde71b870250e96b63e2df5af"
		},
		{
			"name": "Greater Animate Dead",
			"source": "Homebrew Spells",
			"level": 8,
			"school": "N",
			"time": [
				{
					"number": 1,
					"unit": "minute"
				}
			],
			"range": {
				"type": "point",
				"distance": {
					"type": "feet",
					"amount": "10"
				}
			},
			"components": {
				"v": true,
				"s": true,
				"m": {
					"text": "a black sapphire worth at least 500 gp per hit die of the target",
					"cost": 500
				}
			},
			"duration": [
				{
					"type": "instant"
				}
			],
			"entries": [
				"Choose a dead creature within range that has been dead for no more than 7 days. The target is imbued with a foul mimicry of life, raising it as a soulless, undead version of the creature with half its hit point maximum (minimum of 1), but otherwise uses the statistics of the original creature. The creature’s personality is destroyed, it feels no emotions and appears expressionless. However, it knows everything it knew in its past life. The creature obeys any verbal commands you give it. If you issue no commands, the creature only defends itself against hostile creatures. Once given an order, the creature continues to follow it until its task is complete.",
				"The creature is under your control for 24 hours, after which it collapses becoming an inanimate corpse. To maintain control for another 24 hours, you must cast this spell on the creature again before the current 24-hour period ends. This spell has no effect on undead or constructs."
			],
			"classes": {
				"fromClassList": [
					{
						"name": "Cleric",
						"source": "PHB"
					},
					{
						"name": "Wizard",
						"source": "PHB"
					}
				]
			},
			"uniqueId": "c200fe1695223aaffe2410bcbaf52213"
		},
		{
			"name": "Lesser Animate Dead",
			"source": "Homebrew Spells",
			"level": 2,
			"school": "N",
			"time": [
				{
					"number": 1,
					"unit": "minute"
				}
			],
			"range": {
				"type": "point",
				"distance": {
					"type": "feet",
					"amount": "10"
				}
			},
			"components": {
				"v": true,
				"s": true,
				"m": "a drop of blood, a piece of flesh, and a pinch of bone dust"
			},
			"duration": [
				{
					"type": "instant"
				}
			],
			"entries": [
				"This spell creates an undead servant. Choose a pile of bones or a corpse of a Large or smaller beast within range. Your spell imbues the target with a foul mimicry of life, raising it as an undead creature. The target becomes an undead version of the creature with half its hitpoint maximum (minimum of 1), but otherwise uses the statistics of the original creature (the DM has the creature's game statistics). If you chose bones and the creature had a flying speed, the undead version does not have a flying speed.",
				"On each of your turns, you can use a bonus action to mentally command any creature you made with this spell if the creature is within 60 feet of you (if you control multiple creatures, you can command any or all of them at the same time, issuing the same command to each one). You decide what action the creature will take and where it will move during its next turn, or you can issue a general command, such as to guard a particular chamber or corridor. If you issue no commands, the creature only defends itself against hostile creatures. Once given an order, the creature continues to follow it until its task is complete.",
				"The creature is under your control for 24 hours, after which it stops obeying any command you've given it. To maintain control of the creature for another 24 hours, you must cast this spell on the creature again before the current 24-hour period ends. This use of the spell reasserts your control over up to four creatures you have animated with this spell, rather than animating a new one."
			],
			"entriesHigherLevel": [
				{
					"type": "entries",
					"name": "At Higher Levels",
					"entries": [
						"When you cast this spell using a spell slot of 3rd level or higher, you animate or reassert control over two additional undead creatures for each slot level above 2nd. Each of the creatures must come from a different corpse or pile of bones."
					]
				}
			],
			"classes": {
				"fromClassList": [
					{
						"name": "Cleric",
						"source": "PHB"
					},
					{
						"name": "Wizard",
						"source": "PHB"
					}
				]
			},
			"uniqueId": "f9d694a672666f9c32078c62fed06e3a"
		},
		{
			"name": "Lich Jar",
			"source": "Homebrew Spells",
			"level": 6,
			"school": "N",
			"time": [
				{
					"number": 1,
					"unit": "minute"
				}
			],
			"range": {
				"type": "point",
				"distance": {
					"type": "self"
				}
			},
			"components": {
				"v": true,
				"s": true,
				"m": {
					"text": "a gem, crystal, reliquary, or some other ornamental container worth at least 500 gp",
					"cost": 500,
					"consume": true
				}
			},
			"duration": [
				{
					"type": "permanent",
					"ends": [
						"dispel"
					]
				}
			],
			"entries": [
				"This spell can only be cast by a lich. Your body falls lifeless as your will and mind are drawn into the container you used for the spell’s material component. While your essence inhabits the container, you are aware of your surroundings as if you were in the container’s space. You can’t move or use reactions. The only actions you can take are to project your essence up to 100 feet out of the container, attempting to possess a humanoid's body, or to end the spell. Until the spell ends, your body does not reform if you have a phylactery. If your phylactery is destroyed, the spell ends.",
				"You can attempt to possess any humanoid within 100 feet of you that you can see (creatures warded by a protection from evil and good or magic circle spell can’t be possessed). The target must make a Charisma saving throw. On a failure, your essence moves into the target’s body, and the target’s soul becomes trapped in the container. On a success, the target resists your efforts to possess it, and you can’t attempt to possess it again for 24 hours.",
				"Once you possess a creature’s body, you control it. Your game statistics are replaced by the statistics of the creature, though you retain your alignment and your Intelligence, Wisdom, and Charisma scores. You retain the benefit of your own class features, Legendary Resistance, and Paralyzing Touch. If the target has any class levels, you can’t use any of its class features.",
				"Meanwhile, the possessed creature’s soul can perceive from the container using its own senses, but it can’t move or take actions at all.",
				"If another creature's soul is in the container, you can feed it to your phylactery by casting the {@spell imprisonment} spell on it. Instead of choosing one of the normal options of the spell, you can use the spell to magically transfer the target's soul to your phylactery. While trapped in the container, the target makes its saving throw against the spell with disadvantage. Your phylactery must be on the same plane as you for the spell to work.",
				"While possessing a body, you can use your action to return from the host body to the container if it is within 100 feet of you, returning the host creature’s soul to its body. If the host body dies while you’re in it, the creature dies, and you must make a Charisma saving throw against your own spellcasting DC. On a success, you return to the container if it is within 100 feet of you. Otherwise, the spell ends.",
				"If the container is destroyed or the spell ends, your essence is released. If you have a phylactery, your body reforms as normal. Otherwise, you die. If another creature’s soul is in the container when it is destroyed, the creature’s soul returns to its body if the body is alive and within 100 feet. Otherwise, that creature dies.",
				"When the spell ends, the container is destroyed."
			],
			"classes": {
				"fromClassList": [
					{
						"name": "Wizard",
						"source": "PHB"
					}
				]
			},
			"uniqueId": "89ab595bb375274e51d3534a5ae229e6"
		},
		{
			"name": "Mass Charm Person",
			"source": "Homebrew Spells",
			"level": 6,
			"school": "E",
			"time": [
				{
					"number": 1,
					"unit": "action"
				}
			],
			"range": {
				"type": "point",
				"distance": {
					"type": "feet",
					"amount": "300"
				}
			},
			"components": {
				"v": true,
				"m": "a musical instrument"
			},
			"duration": [
				{
					"type": "timed",
					"duration": {
						"type": "hour",
						"amount": 1
					}
				}
			],
			"entries": [
				"You create a magical tune, attempting to charm as many humanoids as you choose within range that can hear it. Each target must make a Wisdom saving throw, and does so with advantage if you or your companions are fighting it. If it fails the saving throw, it is {@condition charmed} by you until the spell ends or until you or your companions do anything harmful to it. When the spell ends, the creature knows it was {@condition charmed} by you."
			],
			"savingThrow": [
				"wisdom"
			],
			"classes": {
				"fromClassList": [
					{
						"name": "Bard",
						"source": "PHB"
					},
					{
						"name": "Wizard",
						"source": "PHB"
					}
				]
			},
			"uniqueId": "20d169ae0d9f9c8690b85f2e15bc4d83"
		},
		{
			"name": "Mute",
			"source": "Homebrew Spells",
			"level": 2,
			"school": "N",
			"time": [
				{
					"number": 1,
					"unit": "action"
				}
			],
			"range": {
				"type": "point",
				"distance": {
					"type": "feet",
					"amount": "30"
				}
			},
			"components": {
				"v": true
			},
			"duration": [
				{
					"type": "timed",
					"duration": {
						"type": "minute",
						"amount": 1
					}
				}
			],
			"entries": [
				"Choose one creature that you can see within range to make a Constitution saving throw. If it fails, the target is unable to speak for the duration. At the end of each of its turns, the target can make a Constitution saving throw. On a Success, the spell ends."
			],
			"entriesHigherLevel": [
				{
					"type": "entries",
					"name": "At Higher Levels",
					"entries": [
						"When you cast this spell using a spell slot of 3rd level or higher, you can target one additional creature for each slot level above 2nd."
					]
				}
			],
			"savingThrow": [
				"constitution"
			],
			"classes": {
				"fromClassList": [
					{
						"name": "Bard",
						"source": "PHB"
					},
					{
						"name": "Cleric",
						"source": "PHB"
					},
					{
						"name": "Sorcerer",
						"source": "PHB"
					},
					{
						"name": "Wizard",
						"source": "PHB"
					}
				]
			},
			"uniqueId": "293bbf3974c76fc13c020a9986edc0c0"
		},
		{
			"name": "Nox Gas",
			"source": "Homebrew Spells",
			"level": 8,
			"school": "C",
			"time": [
				{
					"number": 1,
					"unit": "action"
				}
			],
			"range": {
				"type": "point",
				"distance": {
					"type": "feet",
					"amount": "120"
				}
			},
			"components": {
				"v": true,
				"s": true
			},
			"duration": [
				{
					"type": "timed",
					"duration": {
						"type": "minute",
						"amount": 10,
						"upTo": true
					},
					"concentration": true
				}
			],
			"entries": [
				"You create a 20-foot-radius sphere of noxious, yellow-green fog centered on a point you choose within range. The fog spreads around corners. It lasts for the duration or until strong wind disperses the fog, ending the spell. Its area is heavily obscured.",
				"When a creature enters the spell's area for the first time on a turn or starts its turn there, that creature must make a Wisdom saving throw. On a failed save, the creature is inflicted with short-term madness. If the save fails by 10 or more, the creature is also inflicted with long-term madness. Creatures that can't be poisoned automatically succeed on this saving throw. Once a creature has been driven mad by this spell it no longer makes saves against it until the madness is cured. This spell has no effect on undead or constructs. ",
				"The fog moves 10 feet in a direction you choose at the start of each of your turns, rolling along the surface of the ground. The vapors, being heavier than air, sink to the lowest level of the land, even pouring down openings."
			],
			"savingThrow": [
				"wisdom"
			],
			"classes": {
				"fromClassList": [
					{
						"name": "Wizard",
						"source": "PHB"
					}
				]
			},
			"uniqueId": "9b2f03fcfffb5db5d617b9ebe4d30114"
		},
		{
			"name": "Permanency",
			"source": "Homebrew Spells",
			"level": 7,
			"school": "A",
			"time": [
				{
					"number": 1,
					"unit": "action"
				}
			],
			"range": {
				"type": "point",
				"distance": {
					"type": "feet",
					"amount": "60"
				}
			},
			"components": {
				"v": true,
				"s": true,
				"m": {
					"text": "a diamond, amethyst, opal, sapphire, ruby, topaz, emerald, or jacinth gemstone worth at least 1000 gp, which the spell consumes",
					"cost": 1000,
					"consume": true
				}
			},
			"duration": [
				{
					"type": "instant"
				}
			],
			"entries": [
				"Choose any creature, object, or magical effect within range. Any spell on the target that belongs to the school of magic associated with the material component becomes permanent, its duration changes to until dispelled.",
				"For the purpose of this spell, each school of magic is associated with a specific type of gemstone; diamond with abjuration, amethyst with illusion, opal with enchantment, sapphire with divination, ruby with evocation, topaz with transmutation, emerald with necromancy, and jacinth with conjuration.",
				"Alternatively, choose one of the following spells to make permanent. You cast that spell as part of casting *permanency*, expending spell slots for both. You must provide a gemstone associated with the spell’s school of magic as a material component. The casting time of this spell changes to match that of the chosen spell if that spell has a casting time greater than 1 action.",
				{
					"type": "table",
					"colLabels": [
						"Spell"
					],
					"colStyles": [
						"col-1 text-left"
					],
					"rows": [
						[
							"{@spell animate dead}"
						],
						[
							"{@spell awaken}"
						],
						[
							"{@spell create undead}"
						],
						[
							"{@spell Leomund's secret chest}"
						],
						[
							"{@spell mighty fortress|xge}"
						]
					]
				},
				"When cast in this way, the effect of the spell is made permanent. It no longer has a time limit as stated in its description."
			],
			"classes": {
				"fromClassList": [
					{
						"name": "Wizard",
						"source": "PHB"
					}
				]
			},
			"uniqueId": "9ca0acbcfd8c96d59aca1274ca8dbb0b"
		},
		{
			"name": "Sacred  Sparks",
			"source": "Homebrew Spells",
			"level": 0,
			"school": "V",
			"time": [
				{
					"number": 1,
					"unit": "action"
				}
			],
			"range": {
				"type": "point",
				"distance": {
					"type": "feet",
					"amount": "60"
				}
			},
			"components": {
				"v": true,
				"s": true
			},
			"duration": [
				{
					"type": "instant"
				}
			],
			"entries": [
				"Lightning descends on a creature that you can see within range. The target must make a Dexterity saving throw. On a failed save, the target takes {@damage 1d8} lightning damage. The target has disadvantage on the saving throw if it is wearing armor made of metal. The spell's damage increases by {@damage 1d8} when you reach 5th level ({@damage 2d8}), 11th level ({@damage 3d8}), and 17th level ({@damage 4d8})."
			],
			"damageInflict": [
				"lightning"
			],
			"savingThrow": [
				"dexterity"
			],
			"classes": {
				"fromClassList": [
					{
						"name": "Cleric",
						"source": "PHB"
					}
				]
			},
			"uniqueId": "23c3a9456cb425519aa898c6f5e2d418"
		},
		{
			"name": "Shadow Spray",
			"source": "Homebrew Spells",
			"level": 7,
			"school": "N",
			"time": [
				{
					"number": 1,
					"unit": "action"
				}
			],
			"range": {
				"type": "point",
				"distance": {
					"type": "feet",
					"amount": "60"
				}
			},
			"components": {
				"v": true,
				"s": true
			},
			"duration": [
				{
					"type": "instant"
				}
			],
			"entries": [
				"Six ribbons of shadow burst from your hand, each striking a creature of your choice that you can see within range. Each target must make a Constitution saving throw. Creatures in an area of dim light or darkness have disadvantage on the saving throw. On a failed save, a target takes {@damage 2d10} necrotic damage for each ribbon that strikes it, or half as much damage on a successful save."
			],
			"damageInflict": [
				"necrotic"
			],
			"savingThrow": [
				"constitution"
			],
			"classes": {
				"fromClassList": [
					{
						"name": "Sorcerer",
						"source": "PHB"
					},
					{
						"name": "Wizard",
						"source": "PHB"
					}
				]
			},
			"uniqueId": "3ec11797228d875436f928de1dda9413"
		},
		{
			"name": "Solar Flare",
			"source": "Homebrew Spells",
			"level": 3,
			"school": "V",
			"time": [
				{
					"number": 1,
					"unit": "action"
				}
			],
			"range": {
				"type": "cone",
				"distance": {
					"type": "feet",
					"amount": "60"
				}
			},
			"components": {
				"v": true,
				"s": true
			},
			"duration": [
				{
					"type": "instant"
				}
			],
			"entries": [
				"Blinding sunlight flashes in a 60-foot cone, each creature in that light must make a Constitution saving throw. On a failed save, a creature is {@condition blinded} for 1 minute. Undead and oozes have disadvantage on this saving throw. A creature {@condition blinded} by this spell makes another Constitution saving throw at the end of each of its turns. On a successful save, it is no longer {@condition blinded}. This spell dispels any darkness in its area that was created by a spell of 3rd level or lower."
			],
			"conditionInflict": [
				"blinded"
			],
			"savingThrow": [
				"constitution"
			],
			"classes": {
				"fromClassList": [
					{
						"name": "Cleric",
						"source": "PHB"
					},
					{
						"name": "Druid",
						"source": "PHB"
					},
					{
						"name": "Paladin",
						"source": "PHB"
					},
					{
						"name": "Sorcerer",
						"source": "PHB"
					},
					{
						"name": "Wizard",
						"source": "PHB"
					}
				]
			},
			"uniqueId": "0f3694a92f727c3efb6858cb28c0c1a6"
		},
		{
			"name": "Sun Ward",
			"source": "Homebrew Spells",
			"level": 4,
			"school": "A",
			"time": [
				{
					"number": 1,
					"unit": "action"
				}
			],
			"range": {
				"type": "point",
				"distance": {
					"type": "self"
				}
			},
			"components": {
				"v": true,
				"s": true,
				"m": "a mirror"
			},
			"duration": [
				{
					"type": "timed",
					"duration": {
						"type": "minute",
						"amount": 10
					}
				}
			],
			"entries": [
				"You call upon the life-giving warmth of the sun to protect yourself. For the spell's duration, you shed bright light in a 10-foot radius and dim light for an additional 10 feet, and you have resistance to cold damage. This light is sunlight. You can end the spell early by using an action to dismiss it.",
				"In addition, whenever a creature within 5 feet of you hits you with a melee attack, the attacker takes {@damage 2d8} radiant damage."
			],
			"damageResist": [
				"cold"
			],
			"damageInflict": [
				"radiant"
			],
			"classes": {
				"fromClassList": [
					{
						"name": "Cleric",
						"source": "PHB"
					},
					{
						"name": "Druid",
						"source": "PHB"
					},
					{
						"name": "Paladin",
						"source": "PHB"
					}
				]
			},
			"uniqueId": "dd375f58c4a5105d5d5b82eb4c494a2d"
		},
		{
			"name": "Tito's Tantalizing Taco Stand",
			"source": "Homebrew Spells",
			"level": 2,
			"school": "C",
			"time": [
				{
					"number": 1,
					"unit": "minute"
				}
			],
			"range": {
				"type": "point",
				"distance": {
					"type": "feet",
					"amount": "15"
				}
			},
			"components": {
				"v": true,
				"s": true,
				"m": "a sombrero"
			},
			"duration": [
				{
					"type": "timed",
					"duration": {
						"type": "hour",
						"amount": 1
					}
				}
			],
			"entries": [
				"You conjure a taco stand within range. This taco stand includes a table, umbrella, stove, cooking utensils, all the ingredients needed to make tacos, and decorations of your choosing. 10% of all profits magically vanish and are sent to Tito himself. When the spell ends, everything created by the spell dissipates into smoke."
			],
			"classes": {
				"fromClassList": [
					{
						"name": "Wizard",
						"source": "PHB"
					}
				]
			},
			"uniqueId": "44be459794c85aa838f23bd21682c623"
		},
		{
			"name": "Tsing Tao's Tea Time",
			"source": "Homebrew Spells",
			"level": 2,
			"school": "C",
			"time": [
				{
					"number": 1,
					"unit": "minute"
				}
			],
			"range": {
				"type": "point",
				"distance": {
					"type": "feet",
					"amount": "30"
				}
			},
			"components": {
				"v": true,
				"s": true,
				"m": "a ceramic teapot"
			},
			"duration": [
				{
					"type": "timed",
					"duration": {
						"type": "hour",
						"amount": 1
					}
				}
			],
			"meta": {
				"ritual": true
			},
			"entries": [
				"You conjure a magical tea party that can serve up to 10 people, including tea, a teapot, teacups, tea towels, tea table, chairs, small stove, finger sandwiches, etc. You can create any amount of furniture and decorations within a 30-foot radius of the target location. Any object created by this spell dissipates into smoke if taken out of the target area. A staff of 3 near-transparent servants attend the guests of the party. You decide the visual appearance of the servants and their attire. They are completely obedient to your orders.  Each servant can perform any task a normal human servant could perform but they can’t attack or take any action that would directly harm another creature. When the spell ends, everything created by the spell dissipates into smoke."
			],
			"classes": {
				"fromClassList": [
					{
						"name": "Bard",
						"source": "PHB"
					},
					{
						"name": "Wizard",
						"source": "PHB"
					}
				]
			},
			"uniqueId": "7da77356ca91872d73c48877268127aa"
		}
	]
}